Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
/****************************************************************************
 * arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * The external functions, s32k1xx_lpspiNselect* and s32k1xx_lpspiNstatus
 * must be provided by board-specific logic.  They are implementations of the
 * select and status methods of the SPI interface defined by struct
 * s32k1xx_lpspi_ops_s (see include/nuttx/spi/spi.h).  All other methods
 * (including s32k1xx_lpspibus_initialize()) are provided by common S32K1XX
 * logic.  To use this common SPI logic on your board:
 *
 *   1. Provide logic in s32k1xx_boardinitialize() to configure SPI chip
 *      select pins.
 *   2. Provide s32k1xx_lpspiNselect() and s32k1xx_lpspiNstatus() functions
 *      in your board-specific logic.  These functions will perform chip
 *      selection and status operations using GPIOs in the way your board is
 *      configured.
 *   3. Add a calls to s32k1xx_lpspibus_initialize() in your low level
 *      application initialization logic
 *   4. The handle returned by s32k1xx_lpspibus_initialize() may then be
 *      used to bind the SPI driver to higher level logic (e.g., calling
 *      mmcsd_lpspislotinitialize(), for example, will bind the SPI driver
 *      to the SPI MMC/SD driver).
 *
 * NOTE*: If CONFIG_S32K1XX_LPSPI_HWPCS is selected, s32k1xx_lpspiNselect()
 *        does NOT need to provided by board-specific logic.  In this case a
 *        generic implementation is used that switches between native
 *        hardware chip select pins.  It is important that all pins are
 *        configured when the SPI bus is initialized.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <endian.h>
#include <semaphore.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>
#include <nuttx/spi/slave.h>
#include <nuttx/power/pm.h>

#include "arm_internal.h"
#include "chip.h"

#include "s32k1xx_pin.h"
#include "hardware/s32k1xx_pinmux.h"
#include "hardware/s32k1xx_lpspi.h"
#include "hardware/s32k1xx_pcc.h"
#include "s32k1xx_periphclocks.h"
#include "s32k1xx_lpspi.h"
#include "s32k1xx_lpspi_slave.h"

#include <arch/board/board.h>

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helpers */

static 
inline uint32_t s32k1xx_lpspi_getreg32(struct s32k1xx_lpspidev_s *priv,
                                uint8_t offset);
static 
inline void     s32k1xx_lpspi_putreg32(struct s32k1xx_lpspidev_s *priv,
                            uint8_t offset, uint32_t value);

static void     s32k1xx_lpspi_modifyreg32(struct s32k1xx_lpspidev_s *priv,
                                          uint8_t offset, uint32_t clrbits,
                                          uint32_t setbits);

#ifdef CONFIG_DEBUG_SPI_INFO
static void     s32k1xx_lpspi_dumpregs(struct s32k1xx_lpspidev_s *priv, const char *msg);
#else
#  define       s32k1xx_lpspi_dumpregs(priv,msg)
#endif

/* Interrupt Handling */

static int      s32k1xx_lpspi_interrupt(int irq, void *context, void *arg);

/* SPI Helpers */

static uint32_t s32k1xx_lpspi_dequeue(struct s32k1xx_lpspidev_s *priv);
static void     s32k1xx_lpspi_setTCR(struct s32k1xx_lpspidev_s *priv, 
                                     enum spi_slave_mode_e mode,
                                     uint16_t nbits, uint8_t PCSpin);

/* SPI slave controller methods */

static void     s32k1xx_lpspi_bind(struct spi_slave_ctrlr_s *ctrlr,
                                   struct spi_slave_dev_s *dev,
                                   enum spi_slave_mode_e mode,
                                   int nbits);
static void     s32k1xx_lpspi_unbind(struct spi_slave_ctrlr_s *ctrlr);
static int      s32k1xx_lpspi_enqueue(struct spi_slave_ctrlr_s *ctrlr,
                                      const void *data, size_t len);
static bool     s32k1xx_lpspi_qfull(struct spi_slave_ctrlr_s *ctrlr);
static void     s32k1xx_lpspi_qflush(struct spi_slave_ctrlr_s *ctrlr);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* SPI slave controller driver operations */

#ifdef CONFIG_S32K1XX_LPSPI0_SLAVE
static const struct spi_slave_ctrlrops_s g_spi0_slave_ctrlr_ops =
{
  .bind    = s32k1xx_lpspi_bind,
  .unbind  = s32k1xx_lpspi_unbind,
  .enqueue = s32k1xx_lpspi_enqueue,
  .qfull   = s32k1xx_lpspi_qfull,
  .qflush  = s32k1xx_lpspi_qflush,
};

static struct s32k1xx_lpspidev_s g_spi0_slave_ctrlr =
{
  .ctrlr   =
  {
    .ops   = &g_spi0_slave_ctrlr_ops,
  },
  .base    = S32K1XX_LPSPI0_BASE,
  .spilock = NXMUTEX_INITIALIZER,
  .irq     = S32K1XX_IRQ_LPSPI0,
  .nbits   = CONFIG_SPI_SLAVE_DRIVER_FRAME_SIZE,
  .nss     = true,
  .initialized = false,
};
#endif

