Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
#ifdef CONFIG_S32K1XX_LPSPI1_SLAVE
static const struct spi_slave_ctrlrops_s g_spi1_slave_ctrlr_ops =
{
  .bind    = s32k1xx_lpspi_bind,
  .unbind  = s32k1xx_lpspi_unbind,
  .enqueue = s32k1xx_lpspi_enqueue,
  .qfull   = s32k1xx_lpspi_qfull,
  .qflush  = s32k1xx_lpspi_qflush,
};

static struct s32k1xx_lpspidev_s g_spi1_slave_ctrlr =
{
  .ctrlr   =
  {
    .ops   = &g_spi1_slave_ctrlr_ops,
  },
  .base    = S32K1XX_LPSPI1_BASE,
  .spilock = NXMUTEX_INITIALIZER,
  .irq     = S32K1XX_IRQ_LPSPI1,
  .nbits   = CONFIG_SPI_SLAVE_DRIVER_FRAME_SIZE,
  .nss     = true,
  .initialized = false,
};
#endif

#ifdef CONFIG_S32K1XX_LPSPI2_SLAVE
static const struct spi_slave_ctrlrops_s g_spi2_slave_ctrlr_ops =
{
  .bind    = s32k1xx_lpspi_bind,
  .unbind  = s32k1xx_lpspi_unbind,
  .enqueue = s32k1xx_lpspi_enqueue,
  .qfull   = s32k1xx_lpspi_qfull,
  .qflush  = s32k1xx_lpspi_qflush,
};

static struct s32k1xx_lpspidev_s g_spi2_slave_ctrlr =
{
  .ctrlr   =
  {
    .ops   = &g_spi2_slave_ctrlr_ops,
  },
  .base    = S32K1XX_LPSPI2_BASE,
  .spilock = NXMUTEX_INITIALIZER,
  .irq     = S32K1XX_IRQ_LPSPI2,
  .nbits   = CONFIG_SPI_SLAVE_DRIVER_FRAME_SIZE,
  .nss     = true,
  .initialized = false,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_lpspi_getreg32
 *
 * Description:
 *   Get the contents of the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline
uint32_t s32k1xx_lpspi_getreg32(struct s32k1xx_lpspidev_s *priv,
                                uint8_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: s32k1xx_lpspi_putreg32
 *
 * Description:
 *   Write a 16-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *   value  - the 32-bit value to be written
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline
void s32k1xx_lpspi_putreg32(struct s32k1xx_lpspidev_s *priv,
                            uint8_t offset, uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: s32k1xx_lpspi_modifyreg32
 *
 * Description:
 *   Clear and set bits in register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   offset  - Register offset
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void s32k1xx_lpspi_modifyreg32(struct s32k1xx_lpspidev_s *priv,
                                      uint8_t offset, uint32_t clrbits,
                                      uint32_t setbits)
{
  modifyreg32(priv->base + offset, clrbits, setbits);
}

/****************************************************************************
 * Name: s32k1xx_lpspi_dumpregs
 *
 * Description:
 *   Dump the contents of all SPI registers
 *
 * Input Parameters:
 *   priv - The SPI controller to dump
 *   msg - Message to print before the register data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_SPI_INFO
static void s32k1xx_lpspi_dumpregs(struct s32k1xx_lpspidev_s *priv, const char *msg)
{
  spiinfo("%s:\n", msg);
  spiinfo("  CR:%08x   SR:%08x  IER:%08x\n",
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CR_OFFSET),
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_SR_OFFSET),
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_IER_OFFSET));
  spiinfo("  CFGR1:%08x   FCR:%08x\n",
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CFGR1_OFFSET),
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_FCR_OFFSET));

  spiinfo("  TCR:%08x     RSR:%08x\n",
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_TCR_OFFSET),
          s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_RSR_OFFSET));
}
#endif

/****************************************************************************
 * Name: s32k1xx_lpspi_setTCR
 *
 * Description:
 *   Set SPI mode, Peripheral Chip Select pin, Frame Size and other option
 *   include Clock prescale, LSB first, Byte swap, etc. according to the
 *   Transmit Command Register(TCR) specified in the datasheet. This function 
 *   will force put 32 bits register in single time to avoid register reading
 *   problems accour from reading register while the register is loading from 
 *   FIFO.
 *
 * Input Parameters:
 *   ctrlr  - SPI Slave controller interface instance
 *   mode   - Requested SPI Slave mode
 *   nbits  - The number of bits in an SPI word
 *   PCSpin - Peripheral Chip Select Pin
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void s32k1xx_lpspi_setTCR(struct s32k1xx_lpspidev_s *priv, 
                                 enum spi_slave_mode_e mode,
                                 uint16_t nbits, uint8_t PCSpin)
{
  uint32_t setbits = 0;
  uint32_t men;

  spiinfo("mode=%d \tndits=%d \tPCSpin=%d \n", mode, nbits, PCSpin);
  
  /* Disable LPSPI if it is enabled */

  men = s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CR_OFFSET) & LPSPI_CR_MEN;
  if (men)
    {
      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_MEN, 0);
    }
  
  /* Has the mode changed or first initialize? */

  if (mode != priv->mode || !priv->initialized)
    {
      switch (mode)
        {
        case SPISLAVE_MODE0:     /* CPOL=0; CPHA=0 */
          /* nothing to set here */
          break;

