Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
        case SPISLAVE_MODE1:     /* CPOL=0; CPHA=1 */
          /* set CPHA */
          setbits |= LPSPI_TCR_CPHA;
          break;

        case SPISLAVE_MODE2:     /* CPOL=1; CPHA=0 */
          /* set CPOL */
          setbits |= LPSPI_TCR_CPOL;
          break;

        case SPISLAVE_MODE3:     /* CPOL=1; CPHA=1 */
          setbits |= (LPSPI_TCR_CPOL | LPSPI_TCR_CPHA);
          break;

        default:
          spierr("Invalid mode: %d\n", mode);
          DEBUGPANIC();
          break;
        }

      /* Save the mode so that subsequent re-configurations will be faster */
      
      priv->mode = mode;
    }

  /* Has the number of bits changed or first initialize? */

  if (nbits != priv->nbits || !priv->initialized)
    {

      /* Is the frame size in range 12 bit + 1 */

      if (nbits >= 2 || nbits <= 4096)
        {
          setbits |= LPSPI_TCR_FRAMESZ((uint32_t)nbits - 1);
          
          /* Save the selection so that subsequent re-configurations will
          * be faster.
          */

          priv->nbits = nbits;    /* nbits has been clobbered... save the signed
                                   * value. */
        }
        else
          {
            spierr("Invalid nbits: %d\n", nbits);
          }
    }

  /* Has the PCS pin changed or first initialize? */

  if (PCSpin != priv->PCSpin || !priv->initialized)
    {

      /* PCSpin should be 0,1,2,3 */

      if (PCSpin < 4)
        {
          setbits |= LPSPI_TCR_PCS((uint32_t)PCSpin);
          priv->PCSpin = PCSpin;    /* Save PCSpin config for faster configure */
        }
      else
        {
          spierr("Invalid PCS pin: %d\n", PCSpin);
        }
    }

  spiinfo("set TCR: %08" PRIX32 "\n", setbits);
  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_TCR_OFFSET, setbits);

  /* Re-enable LPSPI if it was enabled previously */

  if (men)
    {
      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 0, LPSPI_CR_MEN);
    }
}

/****************************************************************************
 * Name: s32k1xx_lpspi_enqueue
 *
 * Description:
 *   Enqueue the next value to be shifted out from the interface. This adds
 *   the word to the controller driver for a subsequent transfer but has no
 *   effect on any in-process or currently "committed" transfers.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *   data  - Pointer to the command/data mode data to be shifted out.
 *           The data width must be aligned to the nbits parameter which was
 *           previously provided to the bind() method.
 *   len   - Number of units of "nbits" wide to enqueue,
 *           "nbits" being the data width previously provided to the bind()
 *           method.
 *
 * Returned Value:
 *   Number of data items successfully queued, or a negated errno:
 *         - "len" if all the data was successfully queued
 *         - "0..len-1" if queue is full
 *         - "-errno" in any other error
 *
 ****************************************************************************/

static int s32k1xx_lpspi_enqueue(struct spi_slave_ctrlr_s *ctrlr,
                            const void *data,
                            size_t len)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)ctrlr;
  irqstate_t flags;
  int next;
  int ret;
  ssize_t nwords;

  DEBUGASSERT(priv != NULL && priv->dev != NULL);

  /* Get exclusive access to the SPI device */

  ret = nxmutex_lock(&priv->spilock);
  if (ret < 0)
    {
      return 0;
    }

  /* Check if this word would overflow the circular buffer
   *
   * Interrupts are disabled briefly.
   */

  if (len == 0)
    {
      len = 1;
    }

  flags = enter_critical_section();

  /* enqueque all words of data to FIFO buffer */
  
  for (nwords = 0; nwords < len; nwords++)
    {
      /* Save this new word as the next word to shifted out.  The current
      * word written to the TX data registers is "committed" and will not
      * be overwritten.
      */

      /* store words of data */
      if (SPIS_CTRLR_QFULL(ctrlr) == false)
        {
          priv->outq[priv->tx_head] |= *(const uint8_t *)(data++) << 0;
          priv->outq[priv->tx_head] |= *(const uint8_t *)(data++) << 8;
          priv->outq[priv->tx_head] |= *(const uint8_t *)(data++) << 16;
          priv->outq[priv->tx_head] |= *(const uint8_t *)(data++) << 24;
          
          spiinfo("enqueue [%d]:%04X %04X", priv->tx_head,
                  (uint16_t)((priv->outq[priv->tx_head] >> 16) & 0xffff),
                  (uint16_t)( priv->outq[priv->tx_head]        & 0xffff));
          
          /* Select next word */

          next = priv->tx_head + 1;
          if (next >= CONFIG_SPI_SLAVE_QSIZE)
            {
              next = 0;
            }
          priv->tx_head = next;
          
          /* clear the next word before use */

          priv->outq[priv->tx_head] = 0;
        }
      else
        {
          break;
        }

    }

  if (nwords == 0)
    {
      spierr("Queue full");
    }

  /* enable interrupt when TX data is ready */

  s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET,
                            0, LPSPI_IER_TEIE | LPSPI_IER_TDIE | LPSPI_IER_FCIE);

  leave_critical_section(flags);
  nxmutex_unlock(&priv->spilock);
  return nwords;
}

/****************************************************************************
 * Name: s32k1xx_lpspi_dequeue
 *
 * Description:
 *   Return the next queued output value.  If nothing is in the output queue,
 *   then return the last value obtained from getdata();
 *
 * Input Parameters:
 *   priv - SPI controller CS state
 *
 * Assumptions:
 *   Called only from the SPI interrupt handler so all interrupts are
 *   disabled.
 *
 ****************************************************************************/

static uint32_t s32k1xx_lpspi_dequeue(struct s32k1xx_lpspidev_s *priv)
{
  uint32_t ret;
  int next;

  /* Is the queue empty? */

  if (priv->tx_head != priv->tx_tail)
    {
      /* No, take the oldest value from the tail of the circular buffer */

      ret = priv->outq[priv->tx_tail];

