Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
      spiinfo("dequeue [%d]:%04X %04X", priv->tx_tail,
              (uint16_t)((priv->outq[priv->tx_tail] >> 16) & 0xffff),
              (uint16_t)( priv->outq[priv->tx_tail]        & 0xffff));

      /* Update the tail index, handling wraparound */

      next = priv->tx_tail + 1;
      if (next >= CONFIG_SPI_SLAVE_QSIZE)
        {
          next = 0;
        }

      priv->tx_tail = next;

      /* If the queue is empty Disable further TXDR/OVRE interrupts until
       * spi_enqueue() is called or until we received another command.  We
       * do this only for the case where NSS is non-functional (tied to
       * ground) and we need to end transfers in some fashion.
       */

      if (priv->tx_head == next)
        {
          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET,
                                    LPSPI_IER_TEIE | LPSPI_IER_TDIE | LPSPI_IER_FCIE, 0);
        }
    }
  else
    {
      /* Yes, return the last value we got from the getdata() method */

      ret = priv->outval;

      /* Disable further TXDR/OVRE interrupts until spi_enqueue() is called */

      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET,
                                LPSPI_IER_TEIE | LPSPI_IER_TDIE | LPSPI_IER_FCIE, 0);
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_lpspi_qfull
 *
 * Description:
 *   Return true if the queue is full or false if there is space to add an
 *   additional word to the queue.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   true if the output queue is full, false otherwise.
 *
 ****************************************************************************/

static bool s32k1xx_lpspi_qfull(struct spi_slave_ctrlr_s *ctrlr)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)ctrlr;
  irqstate_t flags;
  bool bret;
  int next;

  DEBUGASSERT(priv != NULL && priv->dev != NULL);

  /* Check if another word would overflow the circular buffer
   *
   * Interrupts are disabled briefly.
   */

  flags = enter_critical_section();
  next = priv->tx_head + 1;
  if (next >= CONFIG_SPI_SLAVE_QSIZE)
    {
      next = 0;
    }

  bret = (next == priv->tx_tail);
  leave_critical_section(flags);
  return bret;
}

/****************************************************************************
 * Name: s32k1xx_lpspi_qflush
 *
 * Description:
 *   Discard all saved values in the output queue. On return from this
 *   function the output queue will be empty. Any in-progress or otherwise
 *   "committed" output values may not be flushed.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void s32k1xx_lpspi_qflush(struct spi_slave_ctrlr_s *ctrlr)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)ctrlr;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL && priv->dev != NULL);

  /* Get exclusive access to the SPI device */

  nxmutex_lock(&priv->spilock);

  /* Mark the buffer empty, momentarily disabling interrupts */

  flags = enter_critical_section();
  priv->tx_head = 0;
  priv->tx_tail = 0;
  leave_critical_section(flags);
  nxmutex_unlock(&priv->spilock);
}

/****************************************************************************
 * Name: s32k1xx_lpspi_interrupt
 *
 * Description:
 *   Common SPI interrupt handler
 *
 * Input Parameters:
 *   priv - SPI controller CS state
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static int s32k1xx_lpspi_interrupt(int irq, void *context, void *arg)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)arg;
  uint32_t sr;
  uint32_t ier;
  uint32_t pending;
  uint32_t regval;

  DEBUGASSERT(priv != NULL);

  /* We loop because the TDRE interrupt will probably immediately follow the
   * RDRF interrupt and we might be able to catch it in this handler
   * execution.
   */

  for (; ; )
    {
      /* Get the current set of pending/enabled interrupts */

      sr      = s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_SR_OFFSET);
      ier     = s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_IER_OFFSET);
      pending = sr & ier;

      spiinfo("SR reg: %08" PRIX32 "\tIER reg: %08" PRIX32 "\n", sr, ier);
      
      regval = s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_FCR_OFFSET);
      spiinfo("RX count: %d\tTX count: %d\n", (int)((regval >> 16) & 7),
                                              (int) (regval & 7) );

      /* Return from the interrupt handler when all pending interrupts have
       * been processed.
       */

      if (pending == 0)
        {
          return OK;
        }

      /* The SPI waits until NSS goes active before receiving the serial
       * clock from an external master. When NSS falls, the clock is
       * validated and the data is loaded in the SPI_RDR depending on the
       * BITS field configured in the SPI_CSR0.  These bits are processed
       * following a phase and a polarity defined respectively by the NCPHA
       * and CPOL bits in the SPI_CSR0.
       *
       * When all bits are processed, the received data is transferred in
       * the SPI_RDR and the RDRF bit rises. If the SPI_RDR has not been
       * read before new data is received, the Overrun Error Status (OVRES)
       * bit in the SPI_SR is set. As long as this flag is set, data is
       * loaded in the SPI_RDR. The user must read SPI_SR to clear the OVRES
       * bit.
       */

      /* Check the RX data overflow condition */

      if ((pending & LPSPI_SR_REF) != 0)
        {
          spierr("ERROR: RX FIFO overflows: %08" PRIX32 "\n", sr);

          /* End the transfer by clear the interrupt flag and reset FIFO */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 
                                    LPSPI_IER_RDIE, 0);

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 0, LPSPI_CR_RRF);
          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_RRF, 0);

          /* cleared Recieve Error Flag (REF) flag */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_SR_OFFSET,
                                    0, LPSPI_SR_REF);

          /* Renable interrupt flag again after reset FIFO */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 
                                    0, LPSPI_IER_RDIE);
        }

      /* Check for the availability of RX data */

