Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
      if ((pending & LPSPI_SR_RDF) != 0)
        {
          uint32_t data;

          /* We get no indication of the falling edge of NSS. But if we are
           * here then it must have fallen.
           */

          if (priv->nss)
            {
              priv->nss = false;
              SPIS_DEV_SELECT(priv->dev, true);
            }

          /* Read the RDR to get the data and to clear the pending RDRF
           * interrupt.
           */

          regval = s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_RDR_OFFSET);
          
          data   = (uint32_t)
            ((regval & LPSPI_RDR_DATA_MASK) >> LPSPI_RDR_DATA_SHIFT);
          
          /* Report the receipt of data to the SPI device driver */
          
          SPIS_DEV_RECEIVE(priv->dev, (const uint32_t *)&data,
                           sizeof(data));

          spiinfo("RDR reg: %04" PRIX32 "\n", regval);
        }

      /* When a transfer starts, the data shifted out is the data present
       * in the Shift register. If no data has been written in the SPI_TDR,
       * the last data received is transferred. If no data has been received
       * since the last reset, all bits are transmitted low, as the Shift
       * register resets to 0.
       *
       * When a first data is written in the SPI_TDR, it is transferred
       * immediately in the Shift register and the TDRE flag rises. If new
       * data is written, it remains in the SPI_TDR until a transfer occurs,
       * i.e., NSS falls and there is a valid clock on the SPCK pin. When
       * the transfer occurs, the last data written in the SPI_TDR is
       * transferred in the Shift register and the TDRE flag rises. This
       * enables frequent updates of critical variables with single
       * transfers.
       *
       * Then, new data is loaded in the Shift register from the SPI_TDR. If
       * no character is ready to be transmitted, i.e., no character has been
       * written in the SPI_TDR since the last load from the SPI_TDR to the
       * Shift register, the SPI_TDR is retransmitted. In this case the
       * Underrun Error Status Flag (UNDES) is set in the SPI_SR.
       */

      /* Check the TX data underflow condition */

      if ((pending & LPSPI_SR_TEF) != 0)
        {
          spierr("ERROR: Underrun (UNDEX): %08" PRIX32 "\n", sr);
          
          /* End the transfer by clear the interrupt flag */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 
                                    LPSPI_IER_TDIE, 0);

          /* cleared Recieve Error Flag (TEF) flag */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_SR_OFFSET,
                                    0, LPSPI_SR_TEF);

          /* Reenable interrupt flag again after reset FIFO */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 
                                    0, LPSPI_IER_TDIE);
        }

      /* Output the next TX data */

      if ((pending & LPSPI_SR_TDF) != 0)
        {
          /* Get the next output value and write it to the TDR
           * The TDRE interrupt is cleared by writing to the from RDR.
           */

          regval = s32k1xx_lpspi_dequeue(priv);

          s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_TDR_OFFSET, regval);

          if (priv->nbits > 32)
            {
              /* reload new data into FIFO */
              regval = s32k1xx_lpspi_dequeue(priv);

              s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_TDR_OFFSET, regval);
            }
        }

      /* The SPI slave hardware provides only an event when NSS rises
       * which may or many not happen at the end of a transfer.  NSSR was
       * cleared by the status read.
       */

      if ((pending & LPSPI_SR_FCF) != 0)
        {
          /* Disable further TEF/TDF interrupts */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET,
                                    LPSPI_IER_TEIE | LPSPI_IER_TDIE, 0);

          /* cleared Frame Complete Flag (FCF) flag */

          s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_SR_OFFSET,
                                    0, LPSPI_SR_FCF);

          /* Report the state change to the SPI device driver */

          priv->nss = true;
          SPIS_DEV_SELECT(priv->dev, false);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpspi_bind
 *
 * Description:
 *   Bind the SPI Slave device interface to the SPI Slave controller
 *   interface and configure the SPI interface. Upon return, the SPI
 *   slave controller driver is fully operational and ready to perform
 *   transfers.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *   dev   - SPI Slave device interface instance
 *   mode  - The SPI mode requested
 *   nbits - The number of bits requests.
 *            If value is greater than 0, then it implies MSB first
 *            If value is less than 0, then it implies LSB first with -nbits
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *   This implementation currently supports only positive "nbits" values,
 *   i.e., it always configures the SPI Slave controller driver as MSB first.
 *
 ****************************************************************************/

static void s32k1xx_lpspi_bind(struct spi_slave_ctrlr_s *ctrlr,
                               struct spi_slave_dev_s *dev,
                               enum spi_slave_mode_e mode,
                               int nbits)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)ctrlr;
  uint32_t regval;
  int ret;
  const void *data;

  spiinfo("blinding dev=%p\n", dev);

  DEBUGASSERT(priv != NULL && priv->dev == NULL && dev != NULL);

  /* Get exclusive access to the SPI device */

  ret = nxmutex_lock(&priv->spilock);
  if (ret < 0)
    {
      /* REVISIT:  No mechanism to report error.  This error should only
       * occur if the calling task was canceled.
       */

      spierr("RROR: nxmutex_lock failed: %d\n", ret);
      return;
    }

  /* Bind the SPI slave device interface instance to the SPI slave
   * controller interface.
   */

  priv->dev = dev;

  /* Call the slaved device's select() and cmddata() methods to indicate
   * the initial state of the chip select and  command/data discretes.
   *
   * NOTE:  Unless we reconfigure the NSS GPIO pin, it may not be possible
   * to read the NSS pin value (I haven't actually tried just reading it).
   * And, since the is no interrupt on the falling edge of NSS, we get no
   * notification when we are selected... not until the arrival of data.
   *
   * REVISIT:  A board-level interface would be required in order to support
   * the Command/Data indication (not yet impklemented).
   */

