Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
  SPIS_DEV_SELECT(dev, false);

  /* Discard any queued data */

  priv->tx_head  = 0;
  priv->tx_tail  = 0;

  /* Call the slave device's getdata() method to get the value that will
   * be shifted out the SPI clock is detected.
   */

  SPIS_DEV_GETDATA(dev, &data);
  priv->outval = *(const uint32_t *)data;
  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_TDR_OFFSET, priv->outval);

  /* Setup to begin normal SPI operation */
  
  /* Noted SPI mode and nbits will be set in s32k1xx_spi_slave_initialize 
   * function to avoid register reading problems in TCR
   */

  // s32k1xx_lpspi_setmode(priv, mode);
  // s32k1xx_lpspi_setbits(priv, nbits);

  /* Clear pending interrupts */

  regval = LPSPI_SR_DMF | LPSPI_SR_REF | LPSPI_SR_TEF | LPSPI_SR_TCF |
           LPSPI_SR_FCF | LPSPI_SR_WCF;
  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_SR_OFFSET, regval);
  
  UNUSED(regval);

  /* Enable SPI interrupts (already enabled at the NVIC):
   *
   * Data Transfer:
   *   SPI_INT_RDRF - Receive Data Register Full Interrupt
   *   SPI_INT_TDRE - Transmit Data Register Empty Interrupt
   *   SPI_INT_NSSR - NSS Rising Interrupt
   *
   * Transfer Errors (for DEBUG purposes only):
   *   SPI_INT_OVRES - Overrun Error Interrupt
   *   SPI_INT_UNDES - Underrun Error Status Interrupt (slave)
   *
   * Not Used:
   *  SPI_INT_MODF    - Mode Fault Error Interrupt
   *  SPI_INT_TXEMPTY  - Transmission Registers Empty Interrupt
   *
   * TX interrupts (SPI_INT_TDRE and SPI_INT_UNDES) are not enabled until
   * the transfer of data actually starts.
   */

  regval = LPSPI_IER_REIE | LPSPI_IER_FCIE | LPSPI_IER_RDIE;
  s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 0, regval);

  nxmutex_unlock(&priv->spilock);
}

/****************************************************************************
 * Name: s32k1xx_lpspi_unbind
 *
 * Description:
 *   Un-bind the SPI Slave device interface from the SPI Slave controller
 *   interface. Reset the SPI interface and restore the SPI Slave
 *   controller driver to its initial state.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void s32k1xx_lpspi_unbind(struct spi_slave_ctrlr_s *ctrlr)
{
  struct s32k1xx_lpspidev_s *priv = (struct s32k1xx_lpspidev_s *)ctrlr;

  DEBUGASSERT(priv != NULL);
  spiinfo("Unbinding %p\n", priv->dev);

  DEBUGASSERT(priv->dev != NULL);

  /* Get exclusive access to the SPI device */

  nxmutex_lock(&priv->spilock);

  /* Disable SPI interrupts (still enabled at the NVIC) */

  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 0);

  /* Unbind the SPI slave interface */

  priv->dev = NULL;

  /* Disable the SPI peripheral */

  s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_MEN, 0);

  /* Execute a software reset of the SPI (twice) */

  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_RST |
                         LPSPI_CR_RRF | LPSPI_CR_RTF);
  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_RST |
                         LPSPI_CR_RRF | LPSPI_CR_RTF);
  s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 0);

  nxmutex_unlock(&priv->spilock);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_spislave_ctrlr_initialize
 *
 * Description:
 *   Initialize the selected SPI Slave bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple SPI Slave interfaces)
 *
 * Returned Value:
 *   Valid SPI Slave controller structure reference on success;
 *   NULL on failure.
 *
 ****************************************************************************/

struct spi_slave_ctrlr_s *s32k1xx_spi_slave_initialize(int bus)
{
  struct s32k1xx_lpspidev_s *priv;
  irqstate_t flags;

  spiinfo("spi bus: %d\n", bus);

  DEBUGASSERT(bus >= 0 && bus <= 2);

  /* Select SPI2 */
  
  #ifdef CONFIG_S32K1XX_LPSPI0_SLAVE
  if (bus == 0) 
    {
      priv = &g_spi0_slave_ctrlr;
    }
  #endif
  #ifdef CONFIG_S32K1XX_LPSPI1_SLAVE
  if (bus == 1)
    {
      priv = &g_spi1_slave_ctrlr;
    }
  #endif
  #ifdef CONFIG_S32K1XX_LPSPI2_SLAVE
  if (bus == 2)
    {
      priv = &g_spi2_slave_ctrlr;
    }
  #endif

  /* Has the SPI hardware been initialized? */

  if (!priv->initialized)
    {
      flags = enter_critical_section();

      /* Disable the SPI peripheral */

      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, LPSPI_CR_MEN, 0);
      
      /* Execute a software reset of the SPI (twice) */

      s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 
                             LPSPI_CR_RST | LPSPI_CR_RTF | LPSPI_CR_RRF);
      s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 
                             LPSPI_CR_RST | LPSPI_CR_RTF | LPSPI_CR_RRF);
      s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 0);

      /* Configure LPSPI in slave mode */

      /* Swap SIN and SOUT pin because incorrect hardware design */

      // s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CFGR1_OFFSET, 
      //                           LPSPI_CFGR1_MASTER, 0);
      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CFGR1_OFFSET, 
                                LPSPI_CFGR1_MASTER, LPSPI_CFGR1_PINCFG_SOUT_SIN);

      #ifdef CONFIG_S32K1XX_LPSPI0_SLAVE
      if (bus == 0) 
        {
          /* Enable peripheral clocking to SPI0 */

          s32k1xx_pclk_enable(LPSPI0_CLK, true);

          /* Configure multiplexed pins as connected on the board. */

          s32k1xx_pinconfig(PIN_LPSPI0_MISO); /* Output */
          s32k1xx_pinconfig(PIN_LPSPI0_MOSI); /* Input */
          s32k1xx_pinconfig(PIN_LPSPI0_SCK);  /* Drives slave */
          s32k1xx_pinconfig(PIN_LPSPI0_PCS);

          if ((PIN_LPSPI0_PCS == PIN_LPSPI0_PCS0_1) ||  
              (PIN_LPSPI0_PCS == PIN_LPSPI0_PCS0_2) || 
              (PIN_LPSPI0_PCS == PIN_LPSPI0_PCS0_3))
            priv->PCSpin = 0;
          
          else if ((PIN_LPSPI0_PCS == PIN_LPSPI0_PCS1_1) || 
                   (PIN_LPSPI0_PCS == PIN_LPSPI0_PCS1_2))
            priv->PCSpin = 1;
          
