Rewlgil/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi_slave.c
          else if (PIN_LPSPI0_PCS == PIN_LPSPI0_PCS2)
            priv->PCSpin = 2;
          
          else if (PIN_LPSPI0_PCS == PIN_LPSPI0_PCS3)
            priv->PCSpin = 3;
        }
      #endif
      #ifdef CONFIG_S32K1XX_LPSPI1_SLAVE
      if (bus == 1)
        {
          /* Enable peripheral clocking to SPI1 */

          s32k1xx_pclk_enable(LPSPI1_CLK, true);

          /* Configure multiplexed pins as connected on the board. */

          s32k1xx_pinconfig(PIN_LPSPI1_MISO); /* Output */
          s32k1xx_pinconfig(PIN_LPSPI1_MOSI); /* Input */
          s32k1xx_pinconfig(PIN_LPSPI1_SCK);  /* Drives slave */
          s32k1xx_pinconfig(PIN_LPSPI1_PCS);

          if ((PIN_LPSPI1_PCS == PIN_LPSPI1_PCS0_1) || 
              (PIN_LPSPI1_PCS == PIN_LPSPI1_PCS0_2) || 
              (PIN_LPSPI1_PCS == PIN_LPSPI1_PCS0_3))
            priv->PCSpin = 0;
          
          else if ((PIN_LPSPI1_PCS == PIN_LPSPI1_PCS1_1) || 
                   (PIN_LPSPI1_PCS == PIN_LPSPI1_PCS1_2))
            priv->PCSpin = 1;
          
          else if (PIN_LPSPI1_PCS == PIN_LPSPI1_PCS2)
            priv->PCSpin = 2;
          
          else if (PIN_LPSPI1_PCS == PIN_LPSPI1_PCS3)
            priv->PCSpin = 3;
        }
      #endif
      #ifdef CONFIG_S32K1XX_LPSPI2_SLAVE
      if (bus == 2)
        {
          /* Enable peripheral clocking to SPI2 */

          s32k1xx_pclk_enable(LPSPI2_CLK, true);

          /* Configure multiplexed pins as connected on the board. */

          s32k1xx_pinconfig(PIN_LPSPI2_MISO); /* Output */
          s32k1xx_pinconfig(PIN_LPSPI2_MOSI); /* Input */
          s32k1xx_pinconfig(PIN_LPSPI2_SCK);  /* Drives slave */
          s32k1xx_pinconfig(PIN_LPSPI2_PCS);

          if ((PIN_LPSPI2_PCS == PIN_LPSPI2_PCS0_1) || 
              (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS0_2) || 
              (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS0_3) || 
              (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS0_4))
            priv->PCSpin = 0;
          
          else if ((PIN_LPSPI2_PCS == PIN_LPSPI2_PCS1_1) || 
                   (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS1_2))
            priv->PCSpin = 1;
          
          else if (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS2)
            priv->PCSpin = 2;
          
          else if (PIN_LPSPI2_PCS == PIN_LPSPI2_PCS3)
            priv->PCSpin = 3;
        }
      #endif

      /* Set water masks */

      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_FCR_OFFSET, 
                                LPSPI_FCR_TXWATER_MASK, LPSPI_FCR_TXWATER(0));
      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_FCR_OFFSET, 
                                LPSPI_FCR_RXWATER_MASK, LPSPI_FCR_RXWATER(1));
      
      /* Set Transmit Command Register */

      s32k1xx_lpspi_setTCR(priv, CONFIG_SPI_SLAVE_DRIVER_MODE, 
                           CONFIG_SPI_SLAVE_DRIVER_FRAME_SIZE, 
                           priv->PCSpin);
      
      /* Disable all SPI interrupts at the SPI peripheral */

      s32k1xx_lpspi_putreg32(priv, S32K1XX_LPSPI_IER_OFFSET, 0);

      /* Attach and enable interrupts at the NVIC */

      DEBUGVERIFY(irq_attach(priv->irq, s32k1xx_lpspi_interrupt, priv));

      up_enable_irq(priv->irq);
      
      /* Enable LPSPI */

      s32k1xx_lpspi_modifyreg32(priv, S32K1XX_LPSPI_CR_OFFSET, 0, LPSPI_CR_MEN);

      priv->initialized = true;

      leave_critical_section(flags);

      s32k1xx_lpspi_dumpregs(priv, "After initialization");
    }

  return &priv->ctrlr;
}
